In [116]:
import numpy as np
import pandas as pd

Data Indexing and Selection

In [117]:
"""                         Data Selection in Series                                     """

'                         Data Selection in Series                                     '

In [118]:
# Series as dictionary

In [119]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index = ["a", "b", "c", "d"])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [120]:
data["b"]

np.float64(0.5)

In [121]:
"a" in data

True

In [122]:
"v" in data

False

In [123]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [124]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [125]:
data["e"] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [126]:
ism = pd.Series(["Kamoliddin", "Diyorbek", "Azizbek", "Sardor",
                 "Izmir", "Alya", "Zubayr", "Zakariyya", "Asu", 
                 "Fotima", "Zuhra", "Hasan", "Husan", "Tolib"], 
                 )
ism

0     Kamoliddin
1       Diyorbek
2        Azizbek
3         Sardor
4          Izmir
5           Alya
6         Zubayr
7      Zakariyya
8            Asu
9         Fotima
10         Zuhra
11         Hasan
12         Husan
13         Tolib
dtype: object

In [127]:
ism[7]

'Zakariyya'

In [128]:
ism[14]= "Abdurahmon"
ism

0     Kamoliddin
1       Diyorbek
2        Azizbek
3         Sardor
4          Izmir
5           Alya
6         Zubayr
7      Zakariyya
8            Asu
9         Fotima
10         Zuhra
11         Hasan
12         Husan
13         Tolib
14    Abdurahmon
dtype: object

In [129]:
# Series as one-dimensional array

In [130]:
data["a":"c"]   # 1. Aniq indeks bo‘yicha kesish (explicit index slicing)

a    0.25
b    0.50
c    0.75
dtype: float64

In [131]:
data[0:2] # 2. Yashirin butun sonli indeks bo‘yicha kesish (implicit integer slicing)

a    0.25
b    0.50
dtype: float64

In [132]:
data[(data > 0.3) & (data < 0.8)] # 3. Maskalash (shart asosida tanlash)

b    0.50
c    0.75
dtype: float64

In [133]:
data[["a", "e"]] # 4. Murakkab indekslash (fancy indexing)

a    0.25
e    1.25
dtype: float64

In [134]:
ism[1]

'Diyorbek'

In [135]:
ism[1 : 4]

1    Diyorbek
2     Azizbek
3      Sardor
dtype: object

In [136]:
ism[[4, 5]]

4    Izmir
5     Alya
dtype: object

In [137]:
# Indexers: loc, iloc, and ix

In [138]:
data = pd.Series(["a", "b", "c"], index = [1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [139]:
data[1]

'a'

In [140]:
data[1:3]

3    b
5    c
dtype: object

In [141]:
data.loc[1]

'a'

In [142]:
data.loc[1:3]

1    a
3    b
dtype: object

In [143]:
data.iloc[1]

'b'

In [144]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [145]:
ism

0     Kamoliddin
1       Diyorbek
2        Azizbek
3         Sardor
4          Izmir
5           Alya
6         Zubayr
7      Zakariyya
8            Asu
9         Fotima
10         Zuhra
11         Hasan
12         Husan
13         Tolib
14    Abdurahmon
dtype: object

In [146]:
ism.loc[1] # konkret indexs boyicha oladi

'Diyorbek'

In [147]:
ism.loc[4:8]

4        Izmir
5         Alya
6       Zubayr
7    Zakariyya
8          Asu
dtype: object

In [148]:
ism.iloc[2]

'Azizbek'

In [149]:
ism.iloc[4:8] # indexs boyicha kesib oladi

4        Izmir
5         Alya
6       Zubayr
7    Zakariyya
dtype: object

In [150]:
"""                            Data Selection in DataFrame                                  """

'                            Data Selection in DataFrame                                  '

In [151]:
# DataFrame as a dictionary

In [152]:
area = pd.Series({
    'California': 423967,
    'Texas': 695662,
    'New York': 141297,
    'Florida': 170312,
    'Illinois': 149995
})

pop = pd.Series({
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135
})

data = pd.DataFrame({'area': area, 'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [153]:
data["area"]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [154]:
data["pop"]

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [155]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [156]:
data.area is data["area"]

True

In [157]:
data.pop is data["pop"]

False

In [158]:
data["density"] = data["pop"] / data["area"]
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [159]:
# DataFrame as two-dimensional array

In [160]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [161]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [162]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [163]:
data["area"]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [164]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [165]:
data.loc[:"Illinois", :"pop"]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [166]:
data.loc[data.density > 100, ["pop", "density"]]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [167]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [168]:
# Additional indexing conventions

In [169]:
data["Florida":"Illinois"]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [170]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [171]:
data[data.density >100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

examples (1- 10)

In [172]:
#1
s = pd.Series([10, 20, 30, 40], index = ["a", "b", "c", "d"])
s.loc[["b", "c"]]

b    20
c    30
dtype: int64

In [173]:
# 2
s = pd.Series([10, 20, 30, 40], index = ["a", "b", "c", "d"])
s.loc[s > 15]

b    20
c    30
d    40
dtype: int64

In [174]:
# 3
s = pd.Series(["x", "y", "z"], index = [2, 4, 6])
s.loc[4]
s.iloc[1]

'y'

In [175]:
# 4
s = pd.Series([5, 15, 25, 35], index= ["a", "b", "c", "d"])
s["a":"b"]

a     5
b    15
dtype: int64

In [176]:
# DataFrame
data = pd.DataFrame({
    "A":[10, 20, 30, 40],
    "B":[5, 15, 25, 35],
    "C":[100, 200, 300, 400]
}, index = ["x", "y", "z", "t"])
data

    A   B    C
x  10   5  100
y  20  15  200
z  30  25  300
t  40  35  400

In [177]:
# 5
data.loc[["y", "z"], ["A", "B"]]

    A   B
y  20  15
z  30  25

In [178]:
# 6
data.iloc[[0, 1], [0, 2]]

    A    C
x  10  100
y  20  200

In [179]:
# 7
data.loc[data.B > 20]

    A   B    C
z  30  25  300
t  40  35  400

In [180]:
data["D"] = data["A"] * 2
data

    A   B    C   D
x  10   5  100  20
y  20  15  200  40
z  30  25  300  60
t  40  35  400  80

In [183]:
data.loc[["x"], ["C"]] = 999
data

    A   B    C   D
x  10   5  999  20
y  20  15  200  40
z  30  25  300  60
t  40  35  400  80

In [182]:
x = data.C > 150
data.loc[x, ["B", "C"]]

    B    C
y  15  200
z  25  300
t  35  400